In [1]:
import matplotlib
matplotlib.__version__

'3.1.1'

In [4]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import scipy.stats as sts
import matplotlib as mpl

In [5]:
# Files to load
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

In [6]:
# Read the city data file and store it in a pandas DataFrame.
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [40]:
# Read the ride data file and store it in a pandas DataFrame.
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [70]:
ride_data_df.head()

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344

In [20]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the DataFrame
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

In [47]:
pyber_data_df.count()

city            2375
date            2375
fare            2375
ride_id         2375
driver_count    2375
type            2375
dtype: int64

In [24]:
# Get the number of rides for each cities.
total_rides = pyber_data_df.groupby(["type"]).count()["ride_id"]
total_rides

type
Rural        125
Suburban     625
Urban       1625
Name: ride_id, dtype: int64

In [62]:
# Get the total number of drivers for each cities. Notice city data had to be used
total_drivers = city_data_df.groupby('type')['driver_count'].sum()
total_drivers

type
Rural         78
Suburban     490
Urban       2405
Name: driver_count, dtype: int64

In [63]:
total_fares = pyber_data_df.groupby('type')['fare'].sum()
total_fares

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

In [65]:
total_fares.sum()

63538.6400000001

In [64]:
# Create the Urban, ruraln and suburban city DataFrame.
urban_cities_df = pyber_data_df[pyber_data_df["type"] == "Urban"]
suburban_cities_df = pyber_data_df[pyber_data_df["type"] == "Suburban"]
rural_cities_df = pyber_data_df[pyber_data_df["type"] == "Rural"]

In [57]:
rural_cities_df

,city,date,fare,ride_id,driver_count,type
2250,Randallchester,2019-04-13 11:13:31,43.22,1076079536213,9,Rural
2251,North Holly,2019-02-02 14:54:00,12.42,1985256326182,8,Rural
2252,Michaelberg,2019-03-27 18:27:34,54.85,4421836952718,6,Rural
2253,Lake Latoyabury,2019-02-23 21:12:24,47.90,3269652929887,2,Rural
2254,Lake Latoyabury,2019-05-06 08:57:56,51.80,4018025271936,2,Rural
...,...,...,...,...,...,...
2370,Michaelberg,2019-04-29 17:04:39,13.38,8550365057598,6,Rural
2371,Lake Latoyabury,2019-01-30 00:05:47,20.76,9018727594352,2,Rural
2372,North Jaime,2019-02-10 21:03:50,11.11,2781339863778,1,Rural
2373,West Heather,2019-05-07 19:22:15,44.94,4256853490277,4,Rural
2374,Newtonview,2019-04-25 10:20:13,55.84,9990581345298,1,Rural

In [69]:
# Calculate Average Fare per Ride for each city type.
average_fare_per_ride = pyber_data_df.groupby('type')['fare'].mean()
average_fare_per_ride

type
Rural       34.623440
Suburban    30.970128
Urban       24.525772
Name: fare, dtype: float64

In [124]:
# Calculate Average Fare per driver for each city type.
average_fare_per_driver = total_fares/total_drivers
# Naming the series index and values Average Fare per driver for each city type.
average_fare_per_driver = pd.DataFrame({"type": average_fare_per_driver.index, "Average fare per driver": average_fare_per_driver.values})
average_fare_per_driver

       type  Average fare per driver
0     Rural                55.486282
1  Suburban                39.502714
2     Urban                16.571468

In [175]:
# Building the summary dataframe
summary_df = pd.merge(total_rides,total_drivers,left_on="type", right_on="type")
summary_df = pd.merge(summary_df, total_fares, left_on="type", right_on="type")
summary_df = pd.merge(summary_df, average_fare_per_ride, left_on="type", right_on="type")
summary_df = pd.merge(summary_df, average_fare_per_driver, left_on="type", right_on="type")
summary_df

,type,ride_id,driver_count,fare_x,fare_y,Average fare per driver
0,Rural,125,78,4327.93,34.623440,55.486282
1,Suburban,625,490,19356.33,30.970128,39.502714
2,Urban,1625,2405,39854.38,24.525772,16.571468

In [176]:
# Renaming columns in summary dataframe
summary_df.rename(columns={'ride_id':'Total Rides', 'driver_count':'Total Drivers','fare_x': 'Total Fares', 'fare_y': 'Average Fare per Ride'}, inplace=True)
summary_df

,type,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average fare per driver
0,Rural,125,78,4327.93,34.623440,55.486282
1,Suburban,625,490,19356.33,30.970128,39.502714
2,Urban,1625,2405,39854.38,24.525772,16.571468

In [177]:
# Setting the index 
summary_df = summary_df.set_index('type')
summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average fare per driver
type,,,,,
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [178]:
# Delete the index name
del summary_df.index.name
summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average fare per driver
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [179]:
#Specific columns
summary_df['Total Fares'] = summary_df['Total Fares'].apply('${:,.2f}'.format)
summary_df['Average Fare per Ride'] = summary_df['Average Fare per Ride'].apply('${:.2f}'.format)
summary_df['Average fare per driver'] = summary_df['Average fare per driver'].apply('${:.2f}'.format)
summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average fare per driver
Rural,125,78,"$4,327.93",$34.62,$55.49
Suburban,625,490,"$19,356.33",$30.97,$39.50
Urban,1625,2405,"$39,854.38",$24.53,$16.57

In [180]:
summary_df['Total Rides'] = summary_df['Total Rides'].apply('{:,}'.format)
summary_df['Total Drivers'] = summary_df['Total Drivers'].apply('{:,}'.format)
summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average fare per driver
Rural,125,78,"$4,327.93",$34.62,$55.49
Suburban,625,490,"$19,356.33",$30.97,$39.50
Urban,"1,625","2,405","$39,854.38",$24.53,$16.57